package com.mongs.play.app.common.internal.data;

import lombok.AllArgsConstructor;
import lombok.Getter;

@Getter
@AllArgsConstructor
public enum MongCodeData {

    CH000("CH000", "화산알", "", 0, 0),
    CH001("CH001", "석탄알", "", 0, 0),
    CH002("CH002", "황금알", "", 0, 0),
    CH003("CH003", "목성알", "", 0, 0),
    CH004("CH004", "지구알", "", 0, 0),
    CH005("CH005", "바람알", "", 0, 0),
    CH100("CH100", "별몽", "CH100", 1, 0),
    CH101("CH101", "동글몽", "CH101", 1, 0),
    CH102("CH102", "네몽", "CH102", 1, 0),
    CH200("CH200", "안씻은 별별몽", "CH100", 2, 150),
    CH210("CH210", "무난한 별별몽", "CH100", 2, 200),
    CH220("CH220", "유쾌한 별별몽", "CH100", 2, 250),
    CH230("CH230", "완벽한 별별몽", "CH100", 2, 300),
    CH201("CH201", "안씻은 둥글몽", "CH101", 2, 150),
    CH211("CH211", "무난한 둥글몽", "CH101", 2, 200),
    CH221("CH221", "유쾌한 둥글몽", "CH101", 2, 250),
    CH231("CH231", "완벽한 둥글몽", "CH101", 2, 300),
    CH202("CH202", "안씻은 나네몽", "CH102", 2, 150),
    CH212("CH212", "무난한 나네몽", "CH102", 2, 200),
    CH222("CH222", "유쾌한 나네몽", "CH102", 2, 250),
    CH232("CH232", "완벽한 나네몽", "CH102", 2, 300),
    CH203("CH203", "까몽", "CH203", 2, 0),
    CH300("CH300", "병든 별뿔몽", "CH100", 3, 150),
    CH310("CH310", "평범한 별뿔몽", "CH100", 3, 200),
    CH320("CH320", "매력적인 별뿔몽", "CH100", 3, 250),
    CH330("CH330", "엘리트 별뿔몽", "CH100", 3, 300),
    CH301("CH301", "병든 땡글몽", "CH101", 3, 150),
    CH311("CH311", "평범한 땡글몽", "CH101", 3, 200),
    CH321("CH321", "매력적인 땡글몽", "CH101", 3, 250),
    CH331("CH331", "엘리트 땡글몽", "CH101", 3, 300),
    CH302("CH302", "병든 마미무메몽", "CH102", 3, 150),
    CH312("CH312", "평범한 마미무메몽", "CH102", 3, 200),
    CH322("CH322", "매력적인 마미무메몽", "CH102", 3, 250),
    CH332("CH332", "엘리트 마미무메몽", "CH102", 3, 300),
    CH303("CH303", "쌔까몽", "CH203", 3, 0)
    ;

    private final String code;
    private final String name;
    private final String baseCode;
    private final Integer level;
    private final Integer evolutionPoint;
}
